# Filtering

- Filtering is widely used while working with the huge amount of data.
- Filtering allows us to extract specific data from the huge dataset for analysis.
- A common operation in data anlysis is to filter values based on condition or multiple conditions.

In [8]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [6]:
df = pd.read_csv('Salaries.csv')
df

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [9]:
df.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [10]:
#Gender is female and salary is greater than 150000

In [12]:
df[(df['sex'] == 'Female') & (df['salary'] > 150000)]

    rank discipline  phd  service     sex  salary
44  Prof          B   23       19  Female  151768
72  Prof          B   24       15  Female  161101

In [13]:
#what is the average salary of female?

In [25]:
df[df['sex'] == 'Female']['salary'].mean()

101002.41025641025

In [17]:
#if we want to submit this particular data and for looking good

avg_salary = df[df['sex'] == 'Female']['salary'].mean()
print('The average salary of Female is', avg_salary)

The average salary of Female is 101002.41025641025

In [18]:
#What is the average salary of rank prof?

In [21]:
df[df['rank'] == 'Prof']['salary'].mean()

123624.80434782608

In [22]:
#What is the average salary of rank prof and discipline is A

In [29]:
df[(df['rank'] == 'Prof') & (df['discipline'] == 'A')]

    rank discipline  phd  service     sex  salary
1   Prof          A   12        6    Male   93000
2   Prof          A   23       20    Male  110515
3   Prof          A   40       31    Male  131205
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
8   Prof          A   29       19    Male   94350
9   Prof          A   51       51    Male   57800
18  Prof          A   19        7    Male  107300
19  Prof          A   29       27    Male  150500
21  Prof          A   33       30    Male  103106
24  Prof          A   30       23    Male   91100
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
32  Prof          A   27       19    Male  103275
37  Prof          A   20        8    Male  102000
40  Prof          A   39       36  Female  137000
52  Prof          A   12        0  Female  105000
63  Prof          A   29       27  Female   91000
65  Prof          A   36       19  Female  117555
67  Prof          A   17       11  Female   90450
69  Prof          A   28        7  Female  116450
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646

In [30]:
#What is the average salary of rank Associate prof

In [32]:
df[df['rank'] == 'AssocProf']['salary'].mean()

91786.23076923077

# Groupby function

- Instead of calculating average salaries separately we can use pandas groupby function.

In [34]:
df.groupby('rank')['salary'].mean()

rank
AssocProf     91786.230769
AsstProf      81362.789474
Prof         123624.804348
Name: salary, dtype: float64

In [37]:
#Groupby aggregate method
#mean,median,min,max

In [38]:
df.groupby('rank')['salary'].agg({'mean','median','min','max'})

              max    min    median           mean
rank
AssocProf  119800  62884  103613.0   91786.230769
AsstProf    97032  63100   78500.0   81362.789474
Prof       186960  57800  123321.5  123624.804348

In [40]:
df.groupby('discipline')['salary'].agg({'mean','median','min','max'})

               max    min    median           mean
discipline
A           155865  57800   93675.0   98331.111111
B           186960  71065  110581.0  116331.785714

In [45]:
df.groupby('sex')['salary'].agg({'mean','median','min','max'})

           max    min    median           mean
sex
Female  161101  62884  103750.0  101002.410256
Male    186960  57800  107300.0  115045.153846

In [47]:
df1 = pd.read_csv('https://raw.githubusercontent.com/aishwaryamate/Datasets/main/nba.csv')
df1

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [48]:
#Extract the data where team is boston celtics and weight is less than 200

In [55]:
df1[(df1['Team'] == 'Boston Celtics') & (df1['Weight'] < 200)]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0

In [52]:
#What is the average salary of players of team los angeles lakers

In [59]:
df1[df1['Team'] == 'Los Angeles Lakers']['Salary'].mean()

4784695.4

In [53]:
#what is the average salary of players based on various position

In [63]:
df1.groupby('Position')['Salary'].mean()

Position
C     5.967052e+06
PF    4.562483e+06
PG    5.077829e+06
SF    4.857393e+06
SG    4.009861e+06
Name: Salary, dtype: float64

In [54]:
#which player is belong from san diego state college

In [65]:
df1[df1['College'] == 'San Diego State']

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
301,Kawhi Leonard,San Antonio Spurs,2.0,SF,24.0,6-7,230.0,San Diego State,16407500.0

In [66]:
#which player from toronto raptors has highest salary

In [69]:
df1[df1['Team'] == 'Toronto Raptors']['Salary'].max()

13600000.0